app/Controllers/SubtareaController.php

SELECT *
FROM `subtareas`
WHERE `subtareas`.`id` = '22'
---
    public function quitarColaborador($id_subtarea)
    {
        if (!session()->get('logueado')) {
            return redirect()->to('/usuarios/login');
        }

        $subtareaModel = new SubtareaModel();
        $tareaModel = new TareaModel();
        $colaboradorRegistroModel = new ColaboradorRegistroModel();

         // Buscar la subtarea
        $subtarea = $subtareaModel->find($id_subtarea);

UPDATE `subtareas` SET `id_responsable` = NULL
WHERE `subtareas`.`id` IN ('22')
---
        $idColaborador = $subtarea['id_responsable'];

        // 1. Actualizar subtarea para quitar responsable
        $subtareaModel->update($id_subtarea, ['id_responsable' => null]);