app/Controllers/SubtareaController.php


            // 4. Si está completada, mover a archivadas
            if ($nuevoEstadoTarea === 'Completada') {
                $tarea = $db->table('tareas')->where('id', $idTarea)->get()->getRowArray();
---
SELECT *
FROM `tareas`
WHERE `tareas`.`id` = '13'

    public function quitarColaborador($id_subtarea)
    {
        if (!session()->get('logueado')) {
            return redirect()->to('/usuarios/login');
        }

        $subtareaModel = new SubtareaModel();
        $tareaModel = new TareaModel();
        $colaboradorRegistroModel = new ColaboradorRegistroModel();

         // Buscar la subtarea
        $subtarea = $subtareaModel->find($id_subtarea);
        if (!$subtarea) {
            return redirect()->back()->with('error', 'Subtarea no encontrada.');
        }

         // Buscar la tarea asociada
         $tarea = $tareaModel->find($subtarea['id_tarea']);
---
SELECT *
FROM `subtareas`
WHERE `id_tarea` = '21'