app/Controllers/TareaController.php

SELECT *
FROM `tareas`
WHERE `tareas`.`id` = '21'
---
    public function editar($id)
    {
        if (!session()->get('logueado')) {
            return redirect()->to('/usuarios/login');
        }
        $model = new TareaModel();
        $tarea = $model->find($id);

SELECT *
FROM `tareas`
WHERE `tareas`.`id` = '21'
---
    public function actualizar($id)
    {
        if (!session()->get('logueado')) {
            return redirect()->to('/usuarios/login');
        }
         $model = new TareaModel();
         $tarea = $model->find($id);