app/Controllers/TareaController.php

DELETE FROM `tareas`
WHERE `id` IN ('25')
---
    public function eliminar($id)
    {
        if (!session()->get('logueado')) {
            return redirect()->to('/usuarios/login');
        }
        $model = new TareaModel();
        $model->delete($id);

SELECT *
FROM `tareas`
WHERE `tareas`.`id` = '13'
SELECT *
FROM `subtareas`
WHERE `id_tarea` = '13'
AND `id_responsable` IS NOT NULL
---
    public function mostrarCompartir($id_tarea)
    {
        if (!session()->get('logueado')) {
            return redirect()->to('/usuarios/login');
        }

         // Instanciar modelos necesarios
        $subtareaModel = new SubtareaModel();
        $colaboradorRegistroModel = new ColaboradorRegistroModel();
        $usuarioModel = new UsuarioModel();
        $tareaModel = new TareaModel();

        //pasar el id_usuario (creador de la tarea) a la vista
        $tarea = $tareaModel->find($id_tarea);
        $idCreadorTarea = $tarea['id_usuario'];

        // Obtener colaboradores disponibles desde altas_colaboradores
        $usuariosDisponibles = $colaboradorRegistroModel
            ->where('estado', 'disponible')
            ->findAll(); // ya tienen el email_colaborador, no hace falta join


        // Obtener subtareas de la tarea que todavía tienen como responsable al creador
        $subtareasDisponibles = $subtareaModel
            ->where('id_tarea', $id_tarea)
            ->where('id_responsable', null)
            ->findAll();

SELECT *
FROM `archivadas`
WHERE `id_usuario` = '1'
---
    public function verArchivadas()
    {
        if (!session()->get('logueado')) {
            return redirect()->to('/usuarios/login');
        }

       /*  $id_usuario = session()->get('id_usuario'); */
        $id_usuario = session()->get('id');

        $db = \Config\Database::connect();
        $archivadas = $db->table('archivadas')
            ->where('id_usuario', $id_usuario)
            ->get()
            ->getResult();