app/Controllers/UsuarioController.php

    public function ingresar()
    {
        $session = session();
        $usuarioModel = new UsuarioModel();
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');
        $usuario = $usuarioModel->where('email', $email)->first();
---
SELECT *
FROM `usuarios`
WHERE `email` = 'sa@gmail.com'
 LIMIT 1